update readme structure
